<template>
  <section>
    <div class="container column gap-60">
      <div class="column gap-30">
        <h1>HTML</h1>

        <p class="fsz20">
          На этой странице представлены рекомендации при работе с шаблонами HTML, которые делают код более читаемым.
        </p>
      </div>

      <div class="column gap-30">
        <h2>Отступы между тегами</h2>

        <p>
          Между родительским и дочерним тегом не должно быть пустой строки.
        </p>

        <ImageLabel img-src="html/html-9.webp" is-bad />

        <ImageLabel img-src="html/html-1.webp" />

        <p>
          Между тегами одного уровня должна быть пустая строка.
        </p>

        <ImageLabel img-src="html/html-2.webp" is-bad />

        <ImageLabel img-src="html/html-3.webp" />
      </div>

      <div class="column gap-30">
        <h2>Порядок атрибутов компонента</h2>

        <ul class="list">
          <li>Цикл (v-for, key)</li>
          <li>Условие показа компонента (v-if)</li>
          <li>Лейбл по которому можно понять назначение компонента</li>
          <li>v-model, если есть</li>
          <li>ID, class и другие стандартные атрибуты</li>
          <li>Пропсы значение которых строки</li>
          <li>Пропсы, которые необходимо bind'ить (:propsName=)</li>
          <li>Пропсы c Boolean значениями</li>
          <li>Слушатели событий (@click=)</li>
        </ul>

        <p>
          Также хорошо группировать пропсы по смыслу, например пропсы которые относятся к валидации можно расположить рядом друг с другом.
        </p>

        <ImageLabel
          label="Порядок свойств"
          img-src="html/html-13.webp"
        />
      </div>

      <div class="column gap-30">
        <h2>Расположение атрибутов</h2>

        <p>
          Если у компонента больше 2 атрибутов, то необходимо записывать их в столбик.
          При этом на строке с тегом не должен оставаться первый атрибут.
          Если количество атрибутов 2 и они занимают большую ширину, их также следует записать в столбик.
        </p>

        <ImageLabel
          label="Первый компонент написан верно"
          img-src="html/html-4.webp"
        />
      </div>

      <div class="column gap-30">
        <h2>Содержимое тега</h2>

        <p>
          Если содержимое тега вместе с атрибутами имеет небольшую длину, то допускается запись в строку. Если содержимое занимает большую ширину, необходимо перенести начало содержимого на новую строку.
        </p>

        <ImageLabel
          label="Первые 2 тега позволяют запись в 1 строку"
          img-src="html/html-5.webp"
        />
      </div>

      <div class="column gap-30">
        <h2>Закрывающий тег</h2>

        <p>
          Если у тега нет содержимого, он должен быть самозакрывающимся.
        </p>

        <ImageLabel
          label="2й тег router-view"
          img-src="html/html-10.webp"
        />
      </div>

      <div class="column gap-30">
        <h2>Открывающий и закрывающий теги</h2>

        <p>
          Открывающий и закрывающий теги должны быть на одном вертикальном уровне, при этом начало и конец открывающего тега также должны быть на одном уровне.
        </p>

        <ImageLabel img-src="html/html-11.webp" is-bad />

        <ImageLabel img-src="html/html-12.webp" />
      </div>

      <div class="column gap-30">
        <h2>Количество тегов</h2>

        <p>
          Не используйте большое количество вложенных тегов. Сложная структура DOM элементов замедляет рендеринг, а также затрудняет читаемость кода.
        </p>

        <ImageLabel img-src="html/html-7.webp" is-bad />

        <ImageLabel img-src="html/html-8.webp" />
      </div>

      <div class="column gap-30">
        <h2>Семантика</h2>

        <p>
          Даже если Вы верстаете не "лэндос", старайтесь не делать "div'ную" верстку.
          Используйте теги подходящие по смыслу. Например если необходима кнопка,
          то не стоит верстать ее через <b class="red">div</b>, для этого есть тег <b class="green">button</b>!
          Для заголовков хорошо подходят теги <b class="green">h1, h2, h3</b> и т.д.
        </p>

        <p>
          Такие элементарные правила улучшать читаемость кода и при беглом взгляде будет сразу видно, где у Вас кнопка, а где заголовок.
        </p>
      </div>

      <div class="column gap-30">
        <h2>SVG</h2>

        <p>
          "Не очень" когда в верстке попадается svg код.
          Занимает много места и к тому же не ясно, что он изображает.
          Полный атас, если при просмотре кода попадается svg, внутри которого много тегов.
        </p>

        <p>
          Выносите все svg в отдельный компонент, в котором по пропсу можно будет понять, что за изображение внутри.
          Также можно использовать svg спрайты.
        </p>

        <ImageLabel img-src="html/svg-1.webp" is-bad />

        <ImageLabel img-src="html/svg-2.webp" />
      </div>

      <div class="column gap-30">
        <h2>Атрибут style</h2>

        <p>
          <b class="red">Крайне не рекомендуется</b> писать стили через атрибут style.
          Такие стили имеют самый большой вес и если потребуется их переопределить,
          придется изловчиться. Также очень сильно снижается читаемость html-кода,
          если таким образом прописано много стилей.
        </p>

        <p>
          Допускается использование данного атрибута в следующих ситуациях:
          Вам нужны вычисляемые параметры в стилях;
          Если Вы уверены, что к данному участку кода Вы никогда не вернетесь
          и в случае правок будут страдать другие разрабы.
        </p>

        <ImageLabel
          label="catbear"
          img-src="cat-3.webp"
          is-gray
        />
      </div>
    </div>
  </section>
</template>

<script setup>
import ImageLabel from '@/components/Image/ImageLabel'
</script>
